{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ad\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true, "name": "lambda_1", "function_type": "lambda", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 24, "border_mode": "valid", "bias": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_1", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "bias": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_2", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "bias": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [2, 2], "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_3", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "bias": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_4", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activity_regularizer": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "bias": true, "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_5", "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.6, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 100, "bias": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.4, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 50, "bias": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 10, "bias": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_3", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "trainable": true, "input_dim": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_4", "activity_regularizer": null}}]}