{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00b5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_1", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "nb_filter": 24, "b_constraint": null, "subsample": [2, 2], "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_2", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "nb_filter": 36, "b_constraint": null, "subsample": [2, 2], "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_3", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5, "nb_col": 5, "nb_filter": 48, "b_constraint": null, "subsample": [2, 2], "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_4", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"bias": true, "name": "convolution2d_5", "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 3, "nb_col": 3, "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.6, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_1", "output_dim": 100, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activation": "linear"}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_2", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_2", "output_dim": 50, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_3", "output_dim": 10, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "name": "dense_4", "output_dim": 1, "init": "glorot_uniform", "b_constraint": null, "trainable": true, "activation": "linear"}}], "keras_version": "1.1.2"}